In [1]:
import pandas as pd

In [2]:
#import school district data for MO
Dist = pd.read_csv('../raw_data/School District List.csv')

In [3]:
Dist.head()

,CTYDIST,ELEMDIST1,DNAME,DADDRESS1,DADDRESS2,DCITY,DZIP,DCOUNTY,DSUPAREA,DPYC,...,SECMI,SDLNAME,SDFNAME,SDMINIT,SDSALUAT,DIEMAIL,URL,HouseDistricts,SenateDistricts,CongressionalDistricts
0,48914,NaN,Academie Lafayette,201 East Armour Boulevard,201 East Armour Boulevard,Kansas City,641111205,Jackson,B,.,...,NaN,Mbengue,Elimane,NaN,Mr.,embengue@academielafayette.org,http://www.academielafayette.org,NaN,NaN,NaN
1,48927,NaN,Academy For Integrated Arts,7910 Troost,NaN,Kansas City,641311920,Jackson,B,NaN,...,NaN,DeGraff,Tricia,NaN,Dr.,tricia.degraff@afiakc.org,http://www.afiakc.org,NaN,NaN,NaN
2,1090,NaN,Adair Co. R-I,600 Rombauer Avenue,NaN,Novinger,635592477,Adair,I,A,...,NaN,Daniels,Robin,M,Mrs.,rdaniels@novinger.k12.mo.us,http://www.novinger.k12.mo.us/,"3 , 4",18,06
3,1092,NaN,Adair Co. R-II,205 W Dewey,NaN,Brashear,635332429,Adair,I,A,...,NaN,Brummit,Joshua,R,Mr.,josh_brummit@adair2.brashear.k12.mo.us,http://brashear.k12.mo.us/,4,18,06
4,7123,NaN,Adrian R-III,601 N Houston,P.O. Box 98,Adrian,647200098,Bates,F,A,...,NaN,Lile,Don,W,Mr.,DON.LILE@ADRIAN.K12.MO.US,http://www.adrian.k12.mo.us,"126, 56 , 57",31,04

In [4]:
#Rename columns and keep only code, name, city, and county
Dist = Dist.rename(columns={'DNAME':'District Name', 'DCITY':'City', 'DCOUNTY':'County', 'CTYDIST':'District Code'})
Dist = Dist[['District Code', 'District Name', 'City', 'County']]
Dist.columns

Index(['District Code', 'District Name', 'City', 'County'], dtype='object')

In [5]:
Dist.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   District Code  559 non-null    int64
 1   District Name  559 non-null    object
 2   City           559 non-null    object
 3   County         558 non-null    object
dtypes: int64(1), object(3)
memory usage: 17.6+ KB

In [6]:
Dist[Dist['County'].isnull()]

     District Code                   District Name             City County
318         201201  Mo Schls For The Sev Disabled   Jefferson City     NaN

In [7]:
#import 'District Accreditation' which has the district accreditation for each district in 2021
Accred = pd.read_excel('../raw_data/District Accreditation.xlsx')

In [8]:
Accred.head()

   SCHOOL_YEAR  COUNTY_DISTRICT_CODE   DISTRICT_NAME CLASSIFICATION
0         2021                  1090   ADAIR CO. R-I              A
1         2021                  1092  ADAIR CO. R-II              A
2         2021                  7123    ADRIAN R-III              A
3         2021                103129    ADVANCE R-IV              A
4         2021                 96098      AFFTON 101              A

In [9]:
#Rename columns of Accred to match Dist and merge the dataframes
Accred = Accred.rename(columns = {'COUNTY_DISTRICT_CODE':'District Code', 'DISTRICT_NAME':'District Name', 'CLASSIFICATION':'Accreditation Status'})
Accred = Accred.drop(columns='SCHOOL_YEAR')

In [10]:
#Change District Name for Nixa Public Schools to match formatting
Accred['District Name'] = Accred['District Name'].replace(['Nixa Public Schools'],'NIXA PUBLIC SCHOOLS')
Accred[Accred['District Name'].str.contains("^NIXA")]

     District Code        District Name Accreditation Status
314          22089  NIXA PUBLIC SCHOOLS                    A

In [11]:
#Correct LONEDELL R-XIV from R-14
Accred['District Name'] = Accred['District Name'].replace(['LONEDELL R-14'],'LONEDELL R-XIV')
Accred[Accred['District Name'].str.contains("^LONE")]

     District Code   District Name Accreditation Status
247          48075   LONE JACK C-6                    A
248          36133  LONEDELL R-XIV                    A

In [12]:
DistrictInfo = Accred.merge(Dist, how='left', on=['District Code'])
DistrictInfo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   District Code         517 non-null    int64
 1   District Name_x       517 non-null    object
 2   Accreditation Status  517 non-null    object
 3   District Name_y       517 non-null    object
 4   City                  517 non-null    object
 5   County                517 non-null    object
dtypes: int64(1), object(5)
memory usage: 28.3+ KB

In [13]:
#review the DataFrame
DistrictInfo.head()

,District Code,District Name_x,Accreditation Status,District Name_y,City,County
0,1090,ADAIR CO. R-I,A,Adair Co. R-I,Novinger,Adair
1,1092,ADAIR CO. R-II,A,Adair Co. R-II,Brashear,Adair
2,7123,ADRIAN R-III,A,Adrian R-III,Adrian,Bates
3,103129,ADVANCE R-IV,A,Advance R-IV,Advance,Stoddard
4,96098,AFFTON 101,A,Affton 101,St. Louis,St. Louis

In [14]:
DistrictInfo[DistrictInfo['Accreditation Status']!= 'A']

,District Code,District Name_x,Accreditation Status,District Name_y,City,County
148,41004,GILMAN CITY R-IV,P,Gilman City R-IV,Gilman City,Harrison
172,78002,HAYTI R-II,P,Hayti R-II,Hayti,Pemiscot
176,48072,HICKMAN MILLS C-1,P,Hickman Mills C-1,Kansas City,Jackson
204,48078,KANSAS CITY 33,P,Kansas City 33,Kansas City,Jackson
301,91091,NAYLOR R-II,P,Naylor R-II,Naylor,Ripley
317,96109,NORMANDY SCHOOLS COLLABORATIVE,P,Normandy Schools Collaborative,St. Louis,St. Louis
399,96111,RIVERVIEW GARDENS,P,Riverview Gardens,St. Louis,St. Louis

In [15]:
#Formatting changes, drop District Name_y and rename District Name_x, change Accreditation Status Values
DistrictInfo = DistrictInfo.drop(columns='District Name_y')
DistrictInfo = DistrictInfo.rename(columns={'District Name_x':'District Name'})
DistrictInfo.loc[DistrictInfo["Accreditation Status"] == "A", "Accreditation Status"] = 'Accredited'
DistrictInfo.loc[DistrictInfo["Accreditation Status"] == "P", "Accreditation Status"] = 'Provisional'

In [16]:
DistrictInfo.head()

   District Code   District Name Accreditation Status        City      County
0           1090   ADAIR CO. R-I           Accredited   Novinger       Adair
1           1092  ADAIR CO. R-II           Accredited   Brashear       Adair
2           7123    ADRIAN R-III           Accredited     Adrian       Bates
3         103129    ADVANCE R-IV           Accredited    Advance    Stoddard
4          96098      AFFTON 101           Accredited  St. Louis   St. Louis

In [17]:
#There is data for 517 school districts

In [18]:
SpendingADA2018 = pd.read_excel('../raw_data/Current Expenditure Per ADA 2009-10 to 2017-18.xlsx', sheet_name='2017-2018')
SpendingADA2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 6 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   District Code                558 non-null    object
 1   District Name                557 non-null    object
 2   Current Operating Cost       557 non-null    float64
 3   ADA                          557 non-null    float64
 4   Current Expenditure per ADA  557 non-null    float64
 5   Unnamed: 5                   0 non-null      float64
dtypes: float64(4), object(2)
memory usage: 26.3+ KB

In [19]:
SpendingADA2018[SpendingADA2018['District Name'].isnull()]

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA,Unnamed: 5
557,NaN,NaN,NaN,NaN,NaN,NaN
558,*St. Louis County Special School District's cu...,NaN,NaN,NaN,NaN,NaN

In [20]:
SpendingADA2018= SpendingADA2018.dropna(how='all', axis=1)

In [21]:
SpendingADA2018= SpendingADA2018.dropna()

In [22]:
SpendingADA2018.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 557 entries, 0 to 556
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   District Code                557 non-null    object
 1   District Name                557 non-null    object
 2   Current Operating Cost       557 non-null    float64
 3   ADA                          557 non-null    float64
 4   Current Expenditure per ADA  557 non-null    float64
dtypes: float64(3), object(2)
memory usage: 26.1+ KB

In [23]:
#make the District Code column consistent in all 3 Spending Data Frames
SpendingADA2018['District Code'] = SpendingADA2018['District Code'].astype('str')
SpendingADA2018['District Code'] = SpendingADA2018['District Code'].str.replace('-', '', regex=False)
SpendingADA2018['District Code'] = SpendingADA2018['District Code'].astype('int')
SpendingADA2018.head()

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA
0,1090,ADAIR CO. R-I,2363915.28,221.8685,10654.58
1,1091,KIRKSVILLE R-III,23357803.68,2312.6776,10099.90
2,1092,ADAIR CO. R-II,2010741.88,143.5462,14007.63
3,2089,NORTH ANDREW CO. R-VI,4160385.58,339.9110,12239.63
4,2090,AVENUE CITY R-IX,1816728.69,198.1104,9170.28

In [24]:
SpendingADA2017 = pd.read_excel('../raw_data/Current Expenditure Per ADA 2009-10 to 2017-18.xlsx', sheet_name='2016-2017')
SpendingADA2017.head()

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA
0,001-090,ADAIR CO. R-I,2278051.28,221.7417,10273.45
1,001-091,KIRKSVILLE R-III,22803699.39,2322.0919,9820.33
2,001-092,ADAIR CO. R-II,1988042.44,161.5064,12309.37
3,002-089,NORTH ANDREW CO. R-VI,3897880.36,342.8458,11369.19
4,002-090,AVENUE CITY R-IX,1854472.62,207.6093,8932.51

In [25]:
SpendingADA2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 557 entries, 0 to 556
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   District Code                557 non-null    object
 1   District Name                556 non-null    object
 2   Current Operating Cost       556 non-null    float64
 3   ADA                          556 non-null    float64
 4   Current Expenditure per ADA  556 non-null    float64
dtypes: float64(3), object(2)
memory usage: 21.9+ KB

In [26]:
SpendingADA2017[SpendingADA2017['District Name'].isnull()]

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA
556,*St. Louis County Special School District's cu...,NaN,NaN,NaN,NaN

In [27]:
SpendingADA2017= SpendingADA2017.dropna()
SpendingADA2017.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 556 entries, 0 to 555
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   District Code                556 non-null    object
 1   District Name                556 non-null    object
 2   Current Operating Cost       556 non-null    float64
 3   ADA                          556 non-null    float64
 4   Current Expenditure per ADA  556 non-null    float64
dtypes: float64(3), object(2)
memory usage: 26.1+ KB

In [28]:
#make the District Code column consistent in all 3 Spending Data Frames
SpendingADA2017['District Code'] = SpendingADA2017['District Code'].astype('str')
SpendingADA2017['District Code'] = SpendingADA2017['District Code'].str.replace('-', '', regex=False)
SpendingADA2017['District Code'] = SpendingADA2017['District Code'].str.replace('*', '', regex=False)
SpendingADA2017['District Code'] = SpendingADA2017['District Code'].astype('int')
SpendingADA2017.head()

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA
0,1090,ADAIR CO. R-I,2278051.28,221.7417,10273.45
1,1091,KIRKSVILLE R-III,22803699.39,2322.0919,9820.33
2,1092,ADAIR CO. R-II,1988042.44,161.5064,12309.37
3,2089,NORTH ANDREW CO. R-VI,3897880.36,342.8458,11369.19
4,2090,AVENUE CITY R-IX,1854472.62,207.6093,8932.51

In [29]:
SpendingADA2016 = pd.read_excel('../raw_data/Current Expenditure Per ADA 2009-10 to 2017-18.xlsx', sheet_name='2015-2016')
SpendingADA2016.head()

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA
0,001-090,ADAIR CO. R-I,2325874.23,228.6835,10170.71
1,001-091,KIRKSVILLE R-III,22956105.94,2283.5390,10052.86
2,001-092,ADAIR CO. R-II,1979855.19,169.6654,11669.17
3,002-089,NORTH ANDREW CO. R-VI,3767990.17,338.5807,11128.78
4,002-090,AVENUE CITY R-IX,1704453.10,199.7665,8532.23

In [30]:
SpendingADA2016.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 558 entries, 0 to 557
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   District Code                557 non-null    object
 1   District Name                556 non-null    object
 2   Current Operating Cost       556 non-null    float64
 3   ADA                          556 non-null    float64
 4   Current Expenditure per ADA  556 non-null    float64
dtypes: float64(3), object(2)
memory usage: 21.9+ KB

In [31]:
SpendingADA2016[SpendingADA2016['District Name'].isnull()]

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA
556,NaN,NaN,NaN,NaN,NaN
557,*St. Louis County Special School District's cu...,NaN,NaN,NaN,NaN

In [32]:
SpendingADA2016= SpendingADA2016.dropna()
SpendingADA2016.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 556 entries, 0 to 555
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   District Code                556 non-null    object
 1   District Name                556 non-null    object
 2   Current Operating Cost       556 non-null    float64
 3   ADA                          556 non-null    float64
 4   Current Expenditure per ADA  556 non-null    float64
dtypes: float64(3), object(2)
memory usage: 26.1+ KB

In [33]:
SpendingADA2018 = SpendingADA2018[SpendingADA2018['District Name']!= 'THE ARCH COMMUNITY SCHOOL']
SpendingADA2018.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 556 entries, 0 to 555
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   District Code                556 non-null    int64
 1   District Name                556 non-null    object
 2   Current Operating Cost       556 non-null    float64
 3   ADA                          556 non-null    float64
 4   Current Expenditure per ADA  556 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 26.1+ KB

In [34]:
#make the District Code column consistent in all 3 Spending Data Frames
SpendingADA2016['District Code'] = SpendingADA2016['District Code'].astype('str')
SpendingADA2016['District Code'] = SpendingADA2016['District Code'].str.replace('-', '', regex=False)
SpendingADA2016['District Code'] = SpendingADA2016['District Code'].str.replace('*', '', regex=False)
SpendingADA2016['District Code'] = SpendingADA2016['District Code'].astype('int')
SpendingADA2016.head()

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA
0,1090,ADAIR CO. R-I,2325874.23,228.6835,10170.71
1,1091,KIRKSVILLE R-III,22956105.94,2283.5390,10052.86
2,1092,ADAIR CO. R-II,1979855.19,169.6654,11669.17
3,2089,NORTH ANDREW CO. R-VI,3767990.17,338.5807,11128.78
4,2090,AVENUE CITY R-IX,1704453.10,199.7665,8532.23

In [35]:
#Check differences in the dataframes using District Name
dif_list = [x for x in list(SpendingADA2018['District Name'].unique()) if x not in list(SpendingADA2017['District Name'].unique())]
print(dif_list)

[]

In [36]:
#The Arch Community School was est in 2017 so we will drop it.

In [37]:
#Check differences in the dataframes using District Name
dif_list = [x for x in list(SpendingADA2017['District Name'].unique()) if x not in list(SpendingADA2016['District Name'].unique())]
print(dif_list)

['KANSAS CITY NEIGHBORHOOD ACAD', 'GUADALUPE CENTERS SCHOOLS', 'KC INTERNATIONAL ACADEMY', 'FRONTIER SCHOOLS', 'CROSSROADS CHARTER SCHOOLS', 'CITIZENS OF THE WORLD CHARTER', 'SPECL. SCH. DST. ST. LOUIS CO.']

In [38]:
# KC Neighborhood was est 2016, Guadalupe Schools rebranded in 2017, KC IA was DElla lamb, 
#CRossroads charter named changed in 2018, Citizens of the World was new,

In [39]:
#Check differences in the dataframes using District Name
dif_list2 = [x for x in list(SpendingADA2016['District Name'].unique()) if x not in list(SpendingADA2017['District Name'].unique())]
print(dif_list2)

['ALTA VISTA CHARTER SCH.', 'DELLA LAMB ELEM.', 'FRONTIER SCHOOL OF INNOVATION', 'CROSSROADS ACAD OF KANSAS CITY', 'SPECL. SCH. DST. ST. LOUIS CO.*', 'JAMAA LEARNING CENTER', 'BETTER LEARNING COMM ACADEMY']

In [40]:
#Jamma closed, Better Learning Com closed, Alta Vista = Guadalupe, 
#Della Lamb = KC International Academy, Crossroads Academy = Crossroads Charter Schools

In [41]:
#Update the Districts in the 2016df with the updated names from 2017
SpendingADA2016.loc[SpendingADA2016["District Name"] == "DELLA LAMB ELEM.", "District Name"] = 'KC INTERNATIONAL ACADEMY'
SpendingADA2016.loc[SpendingADA2016["District Name"] == "ALTA VISTA CHARTER SCH.", "District Name"] = 'GUADALUPE CENTERS SCHOOLS'
SpendingADA2016.loc[SpendingADA2016["District Name"] == "CROSSROADS ACAD OF KANSAS CITY", "District Name"] = 'CROSSROADS CHARTER SCHOOLS'
SpendingADA2016.loc[SpendingADA2016["District Name"] == "FRONTIER SCHOOL OF INNOVATION", "District Name"] = 'FRONTIER SCHOOLS'
SpendingADA2016.loc[SpendingADA2016["District Name"] == "SPECL. SCH. DST. ST. LOUIS CO.*", "District Name"] = 'SPECL. SCH. DST. ST. LOUIS CO.'

In [42]:
dif_list2 = [x for x in list(SpendingADA2016['District Name'].unique()) if x not in list(SpendingADA2017['District Name'].unique())]
print(dif_list2)

['JAMAA LEARNING CENTER', 'BETTER LEARNING COMM ACADEMY']

In [43]:
#Concat the Spending Dataframe together and then average the spending and ADA across the 3 years
ADASpending = pd.concat([SpendingADA2016,SpendingADA2017], ignore_index=True )
ADAspending = pd.concat([ADASpending, SpendingADA2018], ignore_index=True)
ADASpending.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1112 entries, 0 to 1111
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   District Code                1112 non-null   int64
 1   District Name                1112 non-null   object
 2   Current Operating Cost       1112 non-null   float64
 3   ADA                          1112 non-null   float64
 4   Current Expenditure per ADA  1112 non-null   float64
dtypes: float64(3), int64(1), object(1)
memory usage: 43.6+ KB

In [44]:
ADAspending[ADAspending['District Name']== 'ADAIR CO. R-I']

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA
0,1090,ADAIR CO. R-I,2325874.23,228.6835,10170.71
556,1090,ADAIR CO. R-I,2278051.28,221.7417,10273.45
1112,1090,ADAIR CO. R-I,2363915.28,221.8685,10654.58

In [45]:
#Avg the expenditure from the past 3 years and drop the year column
SpendAvg = ADAspending.groupby(['District Code', 'District Name'], as_index=False).mean().round(2)
SpendAvg[SpendAvg['District Name']=='ADAIR CO. R-I']

,District Code,District Name,Current Operating Cost,ADA,Current Expenditure per ADA
0,1090,ADAIR CO. R-I,2322613.6,224.1,10366.25

In [46]:
SpendAvg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 558 entries, 0 to 557
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   District Code                558 non-null    int64
 1   District Name                558 non-null    object
 2   Current Operating Cost       558 non-null    float64
 3   ADA                          558 non-null    float64
 4   Current Expenditure per ADA  558 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 26.2+ KB

In [47]:
SpendAvg= SpendAvg.rename(columns={'Current Operating Cost':'3 year Operating Cost Avg', 'ADA':'3 year ADA Avg', 'Current Expenditure per ADA':'OpCost/ADA'})
SpendAvg.head()

,District Code,District Name,3 year Operating Cost Avg,3 year ADA Avg,OpCost/ADA
0,1090,ADAIR CO. R-I,2322613.60,224.10,10366.25
1,1091,KIRKSVILLE R-III,23039203.00,2306.10,9991.03
2,1092,ADAIR CO. R-II,1992879.84,158.24,12662.06
3,2089,NORTH ANDREW CO. R-VI,3942085.37,340.45,11579.20
4,2090,AVENUE CITY R-IX,1791884.80,201.83,8878.34

In [48]:
Districts = DistrictInfo.merge(SpendAvg, how='left', on=['District Code', 'District Name'])
Districts.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   District Code              517 non-null    int64
 1   District Name              517 non-null    object
 2   Accreditation Status       517 non-null    object
 3   City                       517 non-null    object
 4   County                     517 non-null    object
 5   3 year Operating Cost Avg  517 non-null    float64
 6   3 year ADA Avg             517 non-null    float64
 7   OpCost/ADA                 517 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 36.4+ KB

In [49]:
#Import School District size data
sqmiles = pd.read_excel('../raw_data/School District Area in Square Miles.xls', header=1)
sqmiles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 516 entries, 0 to 515
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   County District  516 non-null    object
 1   District         516 non-null    object
 2   Area (Sq Miles)  516 non-null    float64
dtypes: float64(1), object(2)
memory usage: 12.2+ KB

In [50]:
sqmiles = sqmiles.rename(columns={'County District':'District Code', 'District':'District Name'})
sqmiles.head()

  District Code          District Name  Area (Sq Miles)
0       001-090          Adair Co. R-I       151.486396
1       001-091       Kirksville R-III       255.906530
2       001-092         Adair Co. R-II       132.769923
3       002-089  North Andrew Co. R-VI       132.444530
4       002-090       Avenue City R-IX        19.599477

In [51]:
#match formatting of other DF
sqmiles['District Name'] = sqmiles['District Name'].str.upper()
sqmiles['District Code'] = sqmiles['District Code'].astype('str')
sqmiles['District Code'] = sqmiles['District Code'].str.replace('-', '', regex=False)
sqmiles['District Code'] = sqmiles['District Code'].astype('int')
sqmiles['Area (Sq Miles)'] = sqmiles['Area (Sq Miles)'].round(2)
sqmiles.head()

   District Code          District Name  Area (Sq Miles)
0           1090          ADAIR CO. R-I           151.49
1           1091       KIRKSVILLE R-III           255.91
2           1092         ADAIR CO. R-II           132.77
3           2089  NORTH ANDREW CO. R-VI           132.44
4           2090       AVENUE CITY R-IX            19.60

In [52]:
Districts = Districts.merge(sqmiles, how='left', on=['District Code', 'District Name'])
Districts.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   District Code              517 non-null    int64
 1   District Name              517 non-null    object
 2   Accreditation Status       517 non-null    object
 3   City                       517 non-null    object
 4   County                     517 non-null    object
 5   3 year Operating Cost Avg  517 non-null    float64
 6   3 year ADA Avg             517 non-null    float64
 7   OpCost/ADA                 517 non-null    float64
 8   Area (Sq Miles)            513 non-null    float64
dtypes: float64(4), int64(1), object(4)
memory usage: 40.4+ KB

In [53]:
Districts.sort_values(by='Area (Sq Miles)')

,District Code,District Name,Accreditation Status,City,County,3 year Operating Cost Avg,3 year ADA Avg,OpCost/ADA,Area (Sq Miles)
41,96101,BRENTWOOD,Accredited,Brentwood,St. Louis,1.281760e+07,725.88,17666.25,2.08
165,96103,HANCOCK PLACE,Accredited,St. Louis,St. Louis,1.501930e+07,1398.76,10738.62,2.18
19,96099,BAYLESS,Accredited,St. Louis,St. Louis,1.487027e+07,1617.19,9194.52,2.66
259,96107,MAPLEWOOD-RICHMOND HEIGHTS,Accredited,Maplewood,St. Louis,1.563733e+07,1199.96,13022.82,2.76
75,96102,CLAYTON,Accredited,Clayton,St. Louis,4.516731e+07,2451.81,18418.74,3.21
...,...,...,...,...,...,...,...,...,...
379,86100,PUTNAM CO. R-I,Accredited,Unionville,Putnam,6.249827e+06,666.61,9383.05,507.05
304,73108,NEOSHO SCHOOL DISTRICT,Accredited,Neosho,Newton,3.550038e+07,4370.29,8124.60,NaN
317,96109,NORMANDY SCHOOLS COLLABORATIVE,Provisional,St. Louis,St. Louis,4.464275e+07,3306.08,13509.79,NaN
442,96119,SPECL. SCH. DST. ST. LOUIS CO.,Accredited,Town & Country,St. Louis,3.871552e+08,1874.65,206821.96,NaN
515,109002,WRIGHT CITY R-II OF WARREN CO.,Accredited,Wright City,Warren,1.564367e+07,1553.37,10066.12,NaN

In [54]:
#fill in missing Area data
Districts.loc[Districts["District Name"] == "NEOSHO SCHOOL DISTRICT", "Area (Sq Miles)"] = 221.89
Districts.loc[Districts["District Name"] == "NORMANDY SCHOOLS COLLABORATIVE", "Area (Sq Miles)"] = 10.6
Districts.loc[Districts["District Name"] == "SPECL. SCH. DST. ST. LOUIS CO.", "Area (Sq Miles)"] = 510
Districts.loc[Districts["District Name"] == "WRIGHT CITY R-II OF WARREN CO.", "Area (Sq Miles)"] = 91.02
Districts.sort_values(by='Area (Sq Miles)')

,District Code,District Name,Accreditation Status,City,County,3 year Operating Cost Avg,3 year ADA Avg,OpCost/ADA,Area (Sq Miles)
41,96101,BRENTWOOD,Accredited,Brentwood,St. Louis,1.281760e+07,725.88,17666.25,2.08
165,96103,HANCOCK PLACE,Accredited,St. Louis,St. Louis,1.501930e+07,1398.76,10738.62,2.18
19,96099,BAYLESS,Accredited,St. Louis,St. Louis,1.487027e+07,1617.19,9194.52,2.66
259,96107,MAPLEWOOD-RICHMOND HEIGHTS,Accredited,Maplewood,St. Louis,1.563733e+07,1199.96,13022.82,2.76
75,96102,CLAYTON,Accredited,Clayton,St. Louis,4.516731e+07,2451.81,18418.74,3.21
...,...,...,...,...,...,...,...,...,...
72,23101,CLARK CO. R-I,Accredited,Kahoka,Clark,8.895083e+06,972.95,9141.95,491.97
7,75087,ALTON R-IV,Accredited,Alton,Oregon,5.901950e+06,621.42,9499.61,493.14
217,52096,KNOX CO. R-I,Accredited,Edina,Knox,4.752411e+06,455.87,10427.83,499.01
379,86100,PUTNAM CO. R-I,Accredited,Unionville,Putnam,6.249827e+06,666.61,9383.05,507.05
442,96119,SPECL. SCH. DST. ST. LOUIS CO.,Accredited,Town & Country,St. Louis,3.871552e+08,1874.65,206821.96,510.00

In [55]:
Districts.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   District Code              517 non-null    int64
 1   District Name              517 non-null    object
 2   Accreditation Status       517 non-null    object
 3   City                       517 non-null    object
 4   County                     517 non-null    object
 5   3 year Operating Cost Avg  517 non-null    float64
 6   3 year ADA Avg             517 non-null    float64
 7   OpCost/ADA                 517 non-null    float64
 8   Area (Sq Miles)            517 non-null    float64
dtypes: float64(4), int64(1), object(4)
memory usage: 40.4+ KB

In [56]:
AV2018 = pd.ExcelFile('../raw_data/AV-per-ADA 2020-21 to 2009-10.xlsx')
AV2018.sheet_names

['2021',
 '2020',
 '2019',
 '2018',
 '2017',
 '2016',
 '2015',
 '2014',
 '2013',
 '2012',
 '2011',
 '2010']

In [57]:
#Import School District valuation data
AV2018 = pd.read_excel('../raw_data/AV-per-ADA 2020-21 to 2009-10.xlsx', sheet_name='2018')
AV2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 527 entries, 0 to 526
Data columns (total 5 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   District                          523 non-null    object
 1   Name                              517 non-null    object
 2   December 2017 Assessed Valuation  517 non-null    float64
 3   2018 ADA                          517 non-null    float64
 4   Assessed Valuation per ADA        518 non-null    float64
dtypes: float64(3), object(2)
memory usage: 20.7+ KB

In [58]:
AV2018.head()

,District,Name,December 2017 Assessed Valuation,2018 ADA,Assessed Valuation per ADA
0,001-090,ADAIR CO. R-I,16174642.0,221.8685,72901.930648
1,001-091,KIRKSVILLE R-III,223270593.0,2312.6776,96542.031194
2,001-092,ADAIR CO. R-II,15048352.0,143.5462,104832.813408
3,002-089,NORTH ANDREW CO. R-VI,23459985.0,339.9110,69018.022365
4,002-090,AVENUE CITY R-IX,25153776.0,198.1104,126968.478182

In [59]:
#rename columns
AV2018 = AV2018.rename(columns={'District':'District Code', 'Name':'District Name'})

In [60]:
#match formatting of other DF
AV2018['District Code'] = AV2018['District Code'].astype('str')
AV2018['District Code'] = AV2018['District Code'].str.replace('-', '', regex=False)
AV2018.head()

,District Code,District Name,December 2017 Assessed Valuation,2018 ADA,Assessed Valuation per ADA
0,001090,ADAIR CO. R-I,16174642.0,221.8685,72901.930648
1,001091,KIRKSVILLE R-III,223270593.0,2312.6776,96542.031194
2,001092,ADAIR CO. R-II,15048352.0,143.5462,104832.813408
3,002089,NORTH ANDREW CO. R-VI,23459985.0,339.9110,69018.022365
4,002090,AVENUE CITY R-IX,25153776.0,198.1104,126968.478182

In [61]:
AV2018[AV2018['District Name'].isnull()]

,District Code,District Name,December 2017 Assessed Valuation,2018 ADA,Assessed Valuation per ADA
517,nan,NaN,NaN,NaN,NaN
518,(Total Assessed Value / Total Actual ADA),NaN,NaN,NaN,105074.256774
519,nan,NaN,NaN,NaN,NaN
520,NOTES:,NaN,NaN,NaN,NaN
521,Special school district in Pemiscot Count...,NaN,NaN,NaN,NaN
522,nan,NaN,NaN,NaN,NaN
523,Students living on the federal military b...,NaN,NaN,NaN,NaN
524,"Knob Noster, and 085046 Waynesville as ap...",NaN,NaN,NaN,NaN
525,nan,NaN,NaN,NaN,NaN
526,St. Louis Desegregation Students have be...,NaN,NaN,NaN,NaN

In [62]:
AV2018 = AV2018[AV2018['District Name'].notnull()]

In [63]:
AV2018['District Code'] = AV2018['District Code'].astype('int')

In [64]:
AV2018.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 5 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   District Code                     517 non-null    int64
 1   District Name                     517 non-null    object
 2   December 2017 Assessed Valuation  517 non-null    float64
 3   2018 ADA                          517 non-null    float64
 4   Assessed Valuation per ADA        517 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 24.2+ KB

In [65]:
AV2018['December 2017 Assessed Valuation'] = AV2018['December 2017 Assessed Valuation'].round(2)
AV2018['2018 ADA'] = AV2018['2018 ADA'].round(2)
AV2018['Assessed Valuation per ADA'] = AV2018['Assessed Valuation per ADA'].round(2)
AV2018.head()

,District Code,District Name,December 2017 Assessed Valuation,2018 ADA,Assessed Valuation per ADA
0,1090,ADAIR CO. R-I,16174642.0,221.87,72901.93
1,1091,KIRKSVILLE R-III,223270593.0,2312.68,96542.03
2,1092,ADAIR CO. R-II,15048352.0,143.55,104832.81
3,2089,NORTH ANDREW CO. R-VI,23459985.0,339.91,69018.02
4,2090,AVENUE CITY R-IX,25153776.0,198.11,126968.48

In [66]:
AV2018[AV2018['District Name'].str.contains('^KAN')]

,District Code,District Name,December 2017 Assessed Valuation,2018 ADA,Assessed Valuation per ADA
224,48078,KANSAS CITY 33 & Charters,3.185225e+09,26157.31,121771.89

In [67]:
AV2018[AV2018['District Name'].str.contains('^ST. LOU')]

,District Code,District Name,December 2017 Assessed Valuation,2018 ADA,Assessed Valuation per ADA
516,115115,ST. LOUIS CITY & Charters,4.187363e+09,31231.62,134074.48

In [68]:
#Change District Name for Kansas City 33 and charters  to match formatting
AV2018['District Name'] = AV2018['District Name'].replace(['KANSAS CITY 33 & Charters'],'KANSAS CITY 33')
AV2018['District Name'] = AV2018['District Name'].replace(['ST. LOUIS CITY & Charters'],'ST. LOUIS CITY')

In [69]:
Districts = Districts.merge(AV2018, how='left', on=['District Code', 'District Name'])
Districts.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 12 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   District Code                     517 non-null    int64
 1   District Name                     517 non-null    object
 2   Accreditation Status              517 non-null    object
 3   City                              517 non-null    object
 4   County                            517 non-null    object
 5   3 year Operating Cost Avg         517 non-null    float64
 6   3 year ADA Avg                    517 non-null    float64
 7   OpCost/ADA                        517 non-null    float64
 8   Area (Sq Miles)                   517 non-null    float64
 9   December 2017 Assessed Valuation  517 non-null    float64
 10  2018 ADA                          517 non-null    float64
 11  Assessed Valuation per ADA        517 non-null    float64
dtypes: float64(7), int64(1), object(4)
memory usage: 52.5+ KB

In [70]:
Districts.head()

,District Code,District Name,Accreditation Status,City,County,3 year Operating Cost Avg,3 year ADA Avg,OpCost/ADA,Area (Sq Miles),December 2017 Assessed Valuation,2018 ADA,Assessed Valuation per ADA
0,1090,ADAIR CO. R-I,Accredited,Novinger,Adair,2322613.60,224.10,10366.25,151.49,16174642.0,221.87,72901.93
1,1092,ADAIR CO. R-II,Accredited,Brashear,Adair,1992879.84,158.24,12662.06,132.77,15048352.0,143.55,104832.81
2,7123,ADRIAN R-III,Accredited,Adrian,Bates,5892532.61,647.99,9097.69,130.03,42445349.0,635.85,66753.90
3,103129,ADVANCE R-IV,Accredited,Advance,Stoddard,3369806.02,419.74,8030.90,88.42,33663199.0,417.69,80593.12
4,96098,AFFTON 101,Accredited,St. Louis,St. Louis,24599798.16,2367.51,10395.33,5.93,396346140.0,2370.12,167226.42